
CREATE TABLE recipe(
	recipe_id INT PRIMARY KEY AUTO_INCREMENT,
    recipe_name VARCHAR(32),  #菜名
    recipe_pic  VARCHAR(128)  #菜图片
	nandu VARCHAR(32),	  #难度
	kouwei VARCHAR(32),	  #口味
	gongyi VARCHAR(128),  #工艺
	haoshi VARCHAR(64),	  #耗时
	qiaomen VARCHAR(32),	  #窍门
    userId INT,           #外键用户ID
    FOREIGN KEY(userId) REFERENCES user(uid)
);
INSERT INTO recipe VALUES(NULL,'红烧猪皮',NULL,'简单','咸鲜','煮','一小时',NULL,9);
INSERT INTO recipe VALUES(NULL,'千张结腊鸭腿煮青菜',NULL,'普通','清淡','煮','十分钟',NULL,10);
INSERT INTO recipe VALUES(NULL,'烤鸭腿',NULL,'普通','咸鲜','烤','数小时','下次决定不划花刀了，烤出来有点丑 哈哈哈。
这次烤完还是有很多油，而且锡纸破了。。。下次再烤鸭子这种油多的，还得再加一层硅油纸，刷烤盘很费劲',11);
INSERT INTO recipe VALUES(NULL,'救心菜包子',NULL,'普通','咸鲜','蒸','数小时','1.救心菜本身会有一点苦涩味，所以焯一下水就可以去除这个不好的味道了。2.这次的包子采用的是烫面，烫面所用的水最好是温开水，水温在65度左右为宜。3.烫面包子包好后就可以直接上锅蒸了，不需要再醒发了，计时也是上汽后再计时，具体时间要根据包子的大小，肉的多少来定。',9);
INSERT INTO recipe VALUES(NULL,'口袋面包',NULL,'普通','咸香','煎','十分钟','1.口袋面包里面可以根据自己的喜好来放食材，但不要太多哦，太多容易开口哦。2. 早餐的水果根据时令来定，吃时令水果更好。',12);
INSERT INTO recipe VALUES(NULL,'辣味凉拌金针菇',NULL,'普通','中辣','拌','半小时','金针菇撕成小份后很容易熟，入锅煮的时间不宜太长，变软即可盛出。',13);
INSERT INTO recipe VALUES(NULL,'青菜烧豆腐',NULL,'普通','咸香','烧','十分钟',NULL,13);
INSERT INTO recipe VALUES(NULL,'万圣节栗子小鬼棒棒糖蛋糕',NULL,'普通','甜味','烤','一小时','这款蛋糕是磅蛋糕，制作要点是：黄油一定要完全软化，鸡蛋必须用常温蛋，不能用冷藏过后的鸡蛋，因为用冷藏的鸡蛋在打发的过程中会油水分离，影响蛋糕口感。
以上配方适合用学厨栗子12连模的量。',13);
INSERT INTO recipe VALUES(NULL,'海绵纸杯蛋糕',NULL,'普通','甜味','烘焙','数小时','1. 这款小蛋糕属于全蛋打发，所以动作要快要轻，一定要打发到位，防止消泡。2. 烤箱的温度与时间要根据自己的烤箱实际情况来调整。',13);
INSERT INTO recipe VALUES(NULL,'双色刀切馒头',NULL,'普通','其他','蒸','数小时','1. 馒头刚开始揉面的时候成团就可以，粗糙一点儿没关系，醒发后就会光滑。2. 可可粉也可以刚开始的时候加入。3. 馒头蒸的时间要根据馒头的大小来定，大点的时间就相对长一点儿，小点的时间可以短一点。4. 刀切馒头一定要用一把锋利的刀来切，这样切口才会漂亮。',14);
INSERT INTO recipe VALUES(NULL,'浇汁豆腐',NULL,'简单','其他','其他','廿分钟','调料可以按自己喜好去组织。',15);
INSERT INTO recipe VALUES(NULL,'豆豉鱼小白菜',NULL,'简单','咸鲜','炒','十分钟','1、豆豉鲮鱼跟好多蔬菜都特别搭，食材里的小白菜也可以换成其他蔬菜，如蒿子秆、红薯叶等，前边宝妈也都发过做法。2、鱼罐头本身就有咸味，无需再加盐了。',15);
INSERT INTO recipe VALUES(NULL,'孜然洋葱煸腰片',NULL,'简单','孜然','炒','十分钟','1、猪腰子的腥气主要是白色的腰臊，把猪腰子一切两半就看到了，用刀片下去就可以了。2、猪腰子干煸的时候不要放油，慢煸至无血水，颜色变白，挥发的过程就是去腥。',15);
INSERT INTO recipe VALUES(NULL,'南瓜豆沙卷',NULL,'普通','甜味','蒸','三刻钟','1、第一次和第二次发酵要到位，不确定可以发酵一个小时左右。2、豆沙要铺薄一点，厚了不容易卷紧实。',15);
INSERT INTO recipe VALUES(NULL,'青椒炒鸡腿肉',NULL,'普通','咸鲜','炒','半小时','1、鸡腿肉切成小块后先加配料腌制15分钟，加入胡椒粉和生抽可起到增香提色的作用。2、鸡腿肉切成小块很容易炒熟，入锅炒的时间不宜太长，这样才能保留鸡肉滑嫩的口感。',15);
INSERT INTO recipe VALUES(NULL,'粉蒸鱼块',NULL,'普通','咸鲜','蒸','一小时',NULL,15);
INSERT INTO recipe VALUES(NULL,'三明治早餐',NULL,'普通','其他','烘焙','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'南瓜奶酪芙蓉面疙瘩',NULL,'简单','奶香','煮','廿分钟','我是一名国家儿童营养师，熟知婴幼儿健康饮食需求，精通厨艺，宝宝挑食，厌食，不爱吃饭？怎么补钙铁锌硒?通通帮你解决。微信公众号：一日五餐辅食。陪伴你顺利走过营养辅食路。',15);
INSERT INTO recipe VALUES(NULL,'玉米豌豆炒虾仁',NULL,'普通','咸鲜','炒','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'烤鳞鲫鱼',NULL,'普通','咸香','烤','一小时','1.鳞鲫鱼本身会出油，所以烤的时候不用再次刷油了。2.烤箱的温度和时间，一方面根据自己的烤箱来调整，另一方面要考虑到鱼的大小，鱼大点的需要的时间就长，小一点的需要的时间就会短一些。3.鳞鲫鱼毛刺比较多，所以吃的时候要慢一点哦，另外鳞鲫鱼的鱼头没什么肉，也可以去掉再烤哦。',15);









INSERT INTO recipe VALUES(NULL,'红烧猪皮',NULL,'简单','咸鲜','煮','一小时',NULL,9);
INSERT INTO recipe VALUES(NULL,'千张结腊鸭腿煮青菜',NULL,'普通','清淡','煮','十分钟',NULL,10);
INSERT INTO recipe VALUES(NULL,'烤鸭腿',NULL,'普通','咸鲜','烤','数小时','下次决定不划花刀了，烤出来有点丑 哈哈哈。
这次烤完还是有很多油，而且锡纸破了。。。下次再烤鸭子这种油多的，还得再加一层硅油纸，刷烤盘很费劲',11);
INSERT INTO recipe VALUES(NULL,'救心菜包子',NULL,'普通','咸鲜','蒸','数小时','1.救心菜本身会有一点苦涩味，所以焯一下水就可以去除这个不好的味道了。2.这次的包子采用的是烫面，烫面所用的水最好是温开水，水温在65度左右为宜。3.烫面包子包好后就可以直接上锅蒸了，不需要再醒发了，计时也是上汽后再计时，具体时间要根据包子的大小，肉的多少来定。',9);
INSERT INTO recipe VALUES(NULL,'口袋面包',NULL,'普通','咸香','煎','十分钟','1.口袋面包里面可以根据自己的喜好来放食材，但不要太多哦，太多容易开口哦。2. 早餐的水果根据时令来定，吃时令水果更好。',12);
INSERT INTO recipe VALUES(NULL,'辣味凉拌金针菇',NULL,'普通','中辣','拌','半小时','金针菇撕成小份后很容易熟，入锅煮的时间不宜太长，变软即可盛出。',13);
INSERT INTO recipe VALUES(NULL,'青菜烧豆腐',NULL,'普通','咸香','烧','十分钟',NULL,13);
INSERT INTO recipe VALUES(NULL,'万圣节栗子小鬼棒棒糖蛋糕',NULL,'普通','甜味','烤','一小时','这款蛋糕是磅蛋糕，制作要点是：黄油一定要完全软化，鸡蛋必须用常温蛋，不能用冷藏过后的鸡蛋，因为用冷藏的鸡蛋在打发的过程中会油水分离，影响蛋糕口感。
以上配方适合用学厨栗子12连模的量。',13);
INSERT INTO recipe VALUES(NULL,'海绵纸杯蛋糕',NULL,'普通','甜味','烘焙','数小时','1. 这款小蛋糕属于全蛋打发，所以动作要快要轻，一定要打发到位，防止消泡。2. 烤箱的温度与时间要根据自己的烤箱实际情况来调整。',13);
INSERT INTO recipe VALUES(NULL,'双色刀切馒头',NULL,'普通','其他','蒸','数小时','1. 馒头刚开始揉面的时候成团就可以，粗糙一点儿没关系，醒发后就会光滑。2. 可可粉也可以刚开始的时候加入。3. 馒头蒸的时间要根据馒头的大小来定，大点的时间就相对长一点儿，小点的时间可以短一点。4. 刀切馒头一定要用一把锋利的刀来切，这样切口才会漂亮。',14);
INSERT INTO recipe VALUES(NULL,'浇汁豆腐',NULL,'简单','其他','其他','廿分钟','调料可以按自己喜好去组织。',15);
INSERT INTO recipe VALUES(NULL,'豆豉鱼小白菜',NULL,'简单','咸鲜','炒','十分钟','1、豆豉鲮鱼跟好多蔬菜都特别搭，食材里的小白菜也可以换成其他蔬菜，如蒿子秆、红薯叶等，前边宝妈也都发过做法。2、鱼罐头本身就有咸味，无需再加盐了。',15);
INSERT INTO recipe VALUES(NULL,'孜然洋葱煸腰片',NULL,'简单','孜然','炒','十分钟','1、猪腰子的腥气主要是白色的腰臊，把猪腰子一切两半就看到了，用刀片下去就可以了。2、猪腰子干煸的时候不要放油，慢煸至无血水，颜色变白，挥发的过程就是去腥。',15);
INSERT INTO recipe VALUES(NULL,'南瓜豆沙卷',NULL,'普通','甜味','蒸','三刻钟','1、第一次和第二次发酵要到位，不确定可以发酵一个小时左右。2、豆沙要铺薄一点，厚了不容易卷紧实。',15);
INSERT INTO recipe VALUES(NULL,'青椒炒鸡腿肉',NULL,'普通','咸鲜','炒','半小时','1、鸡腿肉切成小块后先加配料腌制15分钟，加入胡椒粉和生抽可起到增香提色的作用。2、鸡腿肉切成小块很容易炒熟，入锅炒的时间不宜太长，这样才能保留鸡肉滑嫩的口感。',15);
INSERT INTO recipe VALUES(NULL,'粉蒸鱼块',NULL,'普通','咸鲜','蒸','一小时',NULL,15);
INSERT INTO recipe VALUES(NULL,'三明治早餐',NULL,'普通','其他','烘焙','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'南瓜奶酪芙蓉面疙瘩',NULL,'简单','奶香','煮','廿分钟','我是一名国家儿童营养师，熟知婴幼儿健康饮食需求，精通厨艺，宝宝挑食，厌食，不爱吃饭？怎么补钙铁锌硒?通通帮你解决。微信公众号：一日五餐辅食。陪伴你顺利走过营养辅食路。',15);
INSERT INTO recipe VALUES(NULL,'玉米豌豆炒虾仁',NULL,'普通','咸鲜','炒','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'烤鳞鲫鱼',NULL,'普通','咸香','烤','一小时','1.鳞鲫鱼本身会出油，所以烤的时候不用再次刷油了。2.烤箱的温度和时间，一方面根据自己的烤箱来调整，另一方面要考虑到鱼的大小，鱼大点的需要的时间就长，小一点的需要的时间就会短一些。3.鳞鲫鱼毛刺比较多，所以吃的时候要慢一点哦，另外鳞鲫鱼的鱼头没什么肉，也可以去掉再烤哦。',15);










INSERT INTO recipe VALUES(NULL,'红烧猪皮',NULL,'简单','咸鲜','煮','一小时',NULL,9);
INSERT INTO recipe VALUES(NULL,'千张结腊鸭腿煮青菜',NULL,'普通','清淡','煮','十分钟',NULL,10);
INSERT INTO recipe VALUES(NULL,'烤鸭腿',NULL,'普通','咸鲜','烤','数小时','下次决定不划花刀了，烤出来有点丑 哈哈哈。
这次烤完还是有很多油，而且锡纸破了。。。下次再烤鸭子这种油多的，还得再加一层硅油纸，刷烤盘很费劲',11);
INSERT INTO recipe VALUES(NULL,'救心菜包子',NULL,'普通','咸鲜','蒸','数小时','1.救心菜本身会有一点苦涩味，所以焯一下水就可以去除这个不好的味道了。2.这次的包子采用的是烫面，烫面所用的水最好是温开水，水温在65度左右为宜。3.烫面包子包好后就可以直接上锅蒸了，不需要再醒发了，计时也是上汽后再计时，具体时间要根据包子的大小，肉的多少来定。',9);
INSERT INTO recipe VALUES(NULL,'口袋面包',NULL,'普通','咸香','煎','十分钟','1.口袋面包里面可以根据自己的喜好来放食材，但不要太多哦，太多容易开口哦。2. 早餐的水果根据时令来定，吃时令水果更好。',12);
INSERT INTO recipe VALUES(NULL,'辣味凉拌金针菇',NULL,'普通','中辣','拌','半小时','金针菇撕成小份后很容易熟，入锅煮的时间不宜太长，变软即可盛出。',13);
INSERT INTO recipe VALUES(NULL,'青菜烧豆腐',NULL,'普通','咸香','烧','十分钟',NULL,13);
INSERT INTO recipe VALUES(NULL,'万圣节栗子小鬼棒棒糖蛋糕',NULL,'普通','甜味','烤','一小时','这款蛋糕是磅蛋糕，制作要点是：黄油一定要完全软化，鸡蛋必须用常温蛋，不能用冷藏过后的鸡蛋，因为用冷藏的鸡蛋在打发的过程中会油水分离，影响蛋糕口感。
以上配方适合用学厨栗子12连模的量。',13);
INSERT INTO recipe VALUES(NULL,'海绵纸杯蛋糕',NULL,'普通','甜味','烘焙','数小时','1. 这款小蛋糕属于全蛋打发，所以动作要快要轻，一定要打发到位，防止消泡。2. 烤箱的温度与时间要根据自己的烤箱实际情况来调整。',13);
INSERT INTO recipe VALUES(NULL,'双色刀切馒头',NULL,'普通','其他','蒸','数小时','1. 馒头刚开始揉面的时候成团就可以，粗糙一点儿没关系，醒发后就会光滑。2. 可可粉也可以刚开始的时候加入。3. 馒头蒸的时间要根据馒头的大小来定，大点的时间就相对长一点儿，小点的时间可以短一点。4. 刀切馒头一定要用一把锋利的刀来切，这样切口才会漂亮。',14);
INSERT INTO recipe VALUES(NULL,'浇汁豆腐',NULL,'简单','其他','其他','廿分钟','调料可以按自己喜好去组织。',15);
INSERT INTO recipe VALUES(NULL,'豆豉鱼小白菜',NULL,'简单','咸鲜','炒','十分钟','1、豆豉鲮鱼跟好多蔬菜都特别搭，食材里的小白菜也可以换成其他蔬菜，如蒿子秆、红薯叶等，前边宝妈也都发过做法。2、鱼罐头本身就有咸味，无需再加盐了。',15);
INSERT INTO recipe VALUES(NULL,'孜然洋葱煸腰片',NULL,'简单','孜然','炒','十分钟','1、猪腰子的腥气主要是白色的腰臊，把猪腰子一切两半就看到了，用刀片下去就可以了。2、猪腰子干煸的时候不要放油，慢煸至无血水，颜色变白，挥发的过程就是去腥。',15);
INSERT INTO recipe VALUES(NULL,'南瓜豆沙卷',NULL,'普通','甜味','蒸','三刻钟','1、第一次和第二次发酵要到位，不确定可以发酵一个小时左右。2、豆沙要铺薄一点，厚了不容易卷紧实。',15);
INSERT INTO recipe VALUES(NULL,'青椒炒鸡腿肉',NULL,'普通','咸鲜','炒','半小时','1、鸡腿肉切成小块后先加配料腌制15分钟，加入胡椒粉和生抽可起到增香提色的作用。2、鸡腿肉切成小块很容易炒熟，入锅炒的时间不宜太长，这样才能保留鸡肉滑嫩的口感。',15);
INSERT INTO recipe VALUES(NULL,'粉蒸鱼块',NULL,'普通','咸鲜','蒸','一小时',NULL,15);
INSERT INTO recipe VALUES(NULL,'三明治早餐',NULL,'普通','其他','烘焙','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'南瓜奶酪芙蓉面疙瘩',NULL,'简单','奶香','煮','廿分钟','我是一名国家儿童营养师，熟知婴幼儿健康饮食需求，精通厨艺，宝宝挑食，厌食，不爱吃饭？怎么补钙铁锌硒?通通帮你解决。微信公众号：一日五餐辅食。陪伴你顺利走过营养辅食路。',15);
INSERT INTO recipe VALUES(NULL,'玉米豌豆炒虾仁',NULL,'普通','咸鲜','炒','十分钟',NULL,15);
INSERT INTO recipe VALUES(NULL,'烤鳞鲫鱼',NULL,'普通','咸香','烤','一小时','1.鳞鲫鱼本身会出油，所以烤的时候不用再次刷油了。2.烤箱的温度和时间，一方面根据自己的烤箱来调整，另一方面要考虑到鱼的大小，鱼大点的需要的时间就长，小一点的需要的时间就会短一些。3.鳞鲫鱼毛刺比较多，所以吃的时候要慢一点哦，另外鳞鲫鱼的鱼头没什么肉，也可以去掉再烤哦。',15);











